# Pandas quiz

## 1.

Selecting a single column from a DataFrame returns?

```text
A: Another DataFrame
B: A series
C: A numpy array
D: A list
```

In [4]:
import pandas as pd

# Creating a DataFrame
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}

df = pd.DataFrame(data)

# Multiplying the DataFrame by 20
result_df = df * 20

result_df

    A    B    C
0  20   80  140
1  40  100  160
2  60  120  180

## 2.

What happens when you multiply a DataFrame like df*20?

```text
A: Returns a DataFrame with rows doubled
B: Returns a DataFrame with columns doubled
C: Raises a bad operand type error
D: Returns a DataFrame with element-wise application of df*20
```

## 3.

Which of these commands will sort DataFrame df by column name?


```text
A: df.sort_index()
B: df.sort()
C: df.sort_index(axis=1)
D: df.sort(axis=‘columns’)
```

In [6]:
# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Sort the DataFrame by column names
sorted_df = df.sort_index(axis=1)

# Display the sorted DataFrame
print("\nDataFrame sorted by column names:")
print(sorted_df)

Original DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

DataFrame sorted by column names:
   Age           City     Name
0   25       New York    Alice
1   30  San Francisco      Bob
2   35    Los Angeles  Charlie

## 4.

A series is a one-dimensional array which is labelled and can hold any datatype.

```text
A: True
B: False
```

## 5.

Which method iterates over DataFrame columns, returning a tuple with the column name and the content as a Series?

```text
A: iterrows()
B: iteritems()
C: mod()
D: None of the above
```

In [11]:
# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [12]:
# Iterate over DataFrame columns
for column_name, series in df.items():
    print(column_name,series)

Name 0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
Age 0    25
1    30
2    35
Name: Age, dtype: int64
City 0         New York
1    San Francisco
2      Los Angeles
Name: City, dtype: object

## 6

How do you convert the datatype of a column ‘x’ in df from an object to an integer?

```text
A: df[‘x’].astype(‘integer’)
B: int(df[‘x’])
C: df[‘x’].int
D: df[‘x’].astype(int)
```

In [22]:
df['Age']=df['Age'].astype(float)

In [23]:
df

      Name   Age           City
0    Alice  25.0       New York
1      Bob  30.0  San Francisco
2  Charlie  35.0    Los Angeles

## 7.

By default, the pandas dropna() method returns a new DataFrame and will not change the original.

```text
A: True
B: False
```

In [24]:
data = {'A': [1, 2, None, 4],
        'B': [5, None, 7, 8]}

df = pd.DataFrame(data)

In [25]:
df

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  8.0

In [26]:
df.dropna()

     A    B
0  1.0  5.0
3  4.0  8.0

## 8.

What is a correct method to discover if a row is a duplicate?

```text
A: df.duplicates()
B: df.duplicate()
C: df.duplicated()
D: df.delete_duplicates()
```

In [1]:
import pandas as pd

# Create a DataFrame (replace this with your actual DataFrame)
data = {'Column1': [1, 2, 3, 4, 2],
        'Column2': ['A', 'B', 'C', 'D', 'B']}
df = pd.DataFrame(data)

# Check for duplicate rows
duplicate_rows = df.duplicated()

# Display the DataFrame with an additional column indicating duplicates
df['is_duplicate'] = duplicate_rows
print(df)

   Column1 Column2  is_duplicate
0        1       A         False
1        2       B         False
2        3       C         False
3        4       D         False
4        2       B          True

## 9.

```python
import numpy as np

a = np.array([[0, 1, 2], [3, 4, 5]])
b = a.sum(axis=1)
print (b)
```

上面代码的输出结果是？

```text
A: 3
B: 12
C: [3, 12]
D: [3, 5, 7]
E: An exception is thrown
```

In [2]:
import numpy as np

a = np.array([[0, 1, 2], [3, 4, 5]])
b = a.sum(axis=1)
print (b)

[ 3 12]

## 10.

Given DataFrame df with three columns x, y and z which of these would not return the rows where column x is greater than column y and column y is greater than column z?


```text
A: df.query(‘x>y & y>z’)
B: df.query(‘(x>y)’ & ‘(y>z)’)
C: df.query(‘x>y and y>z’)
D: df.query(‘x>y>z’)
```

In [3]:
import pandas as pd

# Creating a DataFrame
data = {'x': [5, 8, 10, 12],
        'y': [3, 6, 9, 15],
        'z': [2, 7, 8, 11]}

df = pd.DataFrame(data)

df

    x   y   z
0   5   3   2
1   8   6   7
2  10   9   8
3  12  15  11

In [9]:
df.query('x>y>z')

    x  y  z
0   5  3  2
2  10  9  8

## 11.

Index of a DataFrame cannot be non-numeric.


```text
A: True
B: False
```

## 12.

The groupby method on DataFrame is associated with what types of operations?

```text
A: split-align-combine
B: split-apply-combine
C: sort-align-combine
D: sort-apply-collate
```